{"url_0": "Health Conditions Condition Spotlight Wellness Topics Product Reviews Featured Programs Featured Lessons Newsletters Lifestyle Quizzes Health News This Just In Top Reads Video Series Find Your Bezzy Community Bezzy communities provide meaningful connections with others living with chronic conditions. Join Bezzy on the web or mobile app. Follow us on social media Can't get enough? Connect with us for all things health. 7 Daily Habits to Protect Your Teeth Take care of your teeth Some say the eyes are the window to the soul. But if you really want to know what someone’s about, check their smile. A welcoming show of pearly whites makes a great first impression, while a tight-lipped smile or whiff of bad breath does the opposite. Read on for tips on how to make sure you’re giving your teeth the care they deserve. 1. Brush two times a day for two minutes Brush your teeth for two minutes, twice a day, says the American Dental Association (ADA) (http://www.mouthhealthy.org/~/media/MouthHealthy/Files/A-Z/Infographic_Brushing_102714.ashx) . This will keep your teeth in top form. Brushing your teeth and tongue with a soft-bristled toothbrush and fluoride toothpaste cleans food and bacteria from your mouth. Brushing also washes out particles that eat away at your teeth and cause cavities. 2. A morning brush fights morning breath The mouth is 98.6ºF (37ºC). Warm and wet, it’s filled with food particles and bacteria. These lead to deposits called plaque. When it builds up, it calcifies, or hardens, on your teeth to form tartar, also called calculus. Not only does tartar irritate your gums, it can lead to gum disease (https://www.healthline.com/health/gingivitis) as well as cause bad breath. Be sure to brush in the morning to help get rid of the plaque that’s built up overnight. 3. Don’t overbrush If you brush more than twice a day, for longer than four minutes total, you could wear down the enamel layer that protects your teeth. When tooth enamel isn’t there, it exposes a layer of dentin. Dentin has tiny holes that lead to nerve endings. When these are triggered, you might feel all sorts of pain. According to the Centers for Disease Control and Prevention, almost 20 percent (https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6023a7.htm) of American adults have experienced pain and sensitivity in their teeth. 4. Don’t turbocharge It’s also possible to brush too hard. Brush your teeth like you’re polishing an eggshell. If your toothbrush looks like someone sat on it, you’re applying too much pressure. Enamel is strong enough to protect teeth from everything that goes on inside your mouth, from eating and drinking to beginning the digestive process. Children and teens have softer enamel than adults (http://www.sipallday.org/userfiles/ckfiles/files/Soft_Drinks_Hard_on_Teeth.pdf) , leaving their teeth more prone to cavities and erosion from food and drink. 5. Make sure you floss every day Want to avoid minimal scraping at your next checkup? Flossing loosens the particles that brushing misses. It also removes plaque, and in so doing prevents the buildup of tartar. While it’s easy to brush plaque away, you need a dentist to remove tartar. 6. It doesn’t matter when you do it You finally have an answer to the age-old question: “Which comes first, flossing or brushing (https://www.healthline.com/health/dental-and-oral-health/is-it-worse-to-skip-brushing-your-teeth-or-flossing) ?” It doesn’t matter, according to the ADA (http://www.patient.co.uk/health/dental-plaque-and-gum-disease) , as long as you do it every day. 7. Stay away from soda “ Sip All Day, Get Decay (http://www.sipallday.org/) ” is a campaign from the Minnesota Dental Association to warn people of the dangers of soft drinks. It’s not just sugar soda, but diet soda, too, that harms teeth. The acid in soda attacks teeth. Once acid eats away at enamel, it goes on to create cavities, leaves stains on the tooth surface, and erodes the inside structure of the tooth (http://www.sipallday.org/userfile"}